Repository: Radouane-oneo/frontend-multiSite
Catalog: sites/all/modules/printconnect/pcproducts/translations/*.po
Languages: nl

source: Products
nl: Drukwerk

source: from_price
nl: Beschikbaar vanaf

source: Select a product
nl: Kies een product

source: Configure your product
nl: Stel je product samen

source: Select your amount
nl: Kies je aantal

source: Quantity
nl: Aantal

source: Price VAT excl.
nl: Prijs excl. BTW

source: Price per piece
nl: Prijs per stuk

source: Enter any quantity or select a price below
nl: Vul je eigen aantal in of selecteer hieronder een aantal

source: Select format
nl: Kies uit een van de beschikbare formaten en upload je eigen ontwerp!

source: @qty pcs.
nl: @qty ex.

source: Additional finishing
nl: Optionele afwerking

source: Supply before
nl: Ontwerp aanleveren voor

source: Your order is ready for shipment
nl: Je bestelling wordt verzonden op:

source: Expected delivery
nl: Geschatte leverdatum

source: Total excl. VAT
nl: Totaal excl. BTW

source: VAT
nl: BTW

source: Total incl. VAT
nl: Totaal incl. BTW

source: Supply times
nl: Aanlevertijden

source: How to prepare your printjob
nl: Hoe je bestanden voorbereiden

source: Finalizing your design? Take into account these requirements:
nl: Je bent je drukklaar bestand aan het voorbereiden? Vergeet zeker deze specificaties niet!

source: Read more
nl: Meer lezen

source: Download your templates here
nl: Snel en eenvoudig een drukklaar bestand maken? Download hier de templates

source: @product, ordering @product
nl: @product, @product drukken en bestellen
